
// 手动控制区域
var __euro ={};
// 好礼区域 
__euro.yp_00 = [{
  name: '好礼_01_尊享',
  // 1为领取 2为已结束
  status: '1',
  msg: ['', '领取', '已结束'],
  price: ''
}, {
  name: '好礼_02_荣耀',
  // 1为领取 2为已结束
  status: '1',
  msg: ['', '领取', '已结束'],
  price: ''
}, {
  name: '好礼_03_旗舰',
  // 1为领取 2为已结束
  status: '1',
  msg: ['', '领取', '已结束'],
  price: ''
}, {
  name: '好礼_04_真爱',
  // 1为领取 2为已结束
  status: '1',
  msg: ['', '领取', '已结束'],
  price: ''
}, {
  name: '好礼_05_揭幕',
  // 1为领取 2为已结束
  status: '1',
  msg: ['', '<span class="yp_go_money"><span class="yp_RMB">¥</span>6.10</span>', '<span class="yp_go_txt yp_00_06_txt">已结束</span>'],
  price: ''
}, {
  name: '好礼_06_新人',
  // 1为领取 2为已结束
  status: '1',
  msg: ['', '<span class="yp_go_money1">首单<span class="yp_RMB">¥</span><em>1</em></span>', '<span class="yp_go_txt yp_00_06_txt">已结束</span>'],
  price: ''
}];




// 全赛事礼包 all
__euro.yp_01 = yp_all = [{
  //不可修改 id 
  id: 'yp_01_01',
  //不可修改 
  name: '全赛事礼包_01_亚盘',
  //不可修改 
  packname: '全赛事礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '领取', '已结束', '已领取'],
  //可修改 购买价格
  price: '888',
  //可修改 划去的价格
  oldprice: '1888',
  //不可修改 玩法类型
  gameType: 'z_sx',
  //不可修改 包类型id
  packType: '4',
  //可修改 多少场比赛
  explain: '51场比赛<em>888</em>元特惠'
}, {
  //不可修改 id 
  id: 'yp_01_02',
  //不可修改 
  name: '全赛事礼包_02_胜平负',
  //不可修改 
  packname: '全赛事礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '领取', '已结束', '已领取'],
  //可修改 购买价格
  price: '888',
  //可修改 划去的价格
  oldprice: '1888',
  //不可修改 玩法类型
  gameType: 'z_spf',
  //不可修改 包类型id
  packType: '4',
  //可修改 多少场比赛
  explain: '51场比赛<em>888</em>元特惠'
}, {
  //不可修改 id 
  id: 'yp_01_03',
  //不可修改 
  name: '全赛事礼包_03_大小球',
  //不可修改 
  packname: '全赛事礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '领取', '已结束', '已领取'],
  //可修改 购买价格
  price: '888',
  //可修改 划去的价格
  oldprice: '1888',
  //不可修改 玩法类型
  gameType: 'z_dx',
  //不可修改 包类型id
  packType: '4',
  //可修改 多少场比赛
  explain: '51场比赛<em>888</em>元特惠'
}];

// 小组赛礼包 group
__euro.yp_02 = yp_group = [{
  //不可修改 id 
  id: 'yp_02_01',
  //不可修改 
  name: '小组赛礼包_01_亚盘',
  //不可修改 
  packname: '小组赛礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '领取', '已结束', '已领取'],
  //可修改 购买价格
  price: '666',
  //可修改 划去的价格
  oldprice: '1044',
  //不可修改 玩法类型
  gameType: 'z_sx',
  //不可修改 包类型id
  packType: '1',
  //可修改 多少场比赛
  explain: '36场比赛<em>666</em>元特惠'
}, {
  //不可修改 id 
  id: 'yp_02_02',
  //不可修改 
  name: '小组赛礼包_02_胜平负',
  //不可修改 
  packname: '小组赛礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '领取', '已结束', '已领取'],
  //可修改 购买价格
  price: '666',
  //可修改 划去的价格
  oldprice: '1044',
  //不可修改 玩法类型
  gameType: 'z_spf',
  //不可修改 包类型id
  packType: '1',
  //可修改 多少场比赛
  explain: '36场比赛<em>666</em>元特惠'
}, {
  //不可修改 id 
  id: 'yp_02_03',
  //不可修改 
  name: '小组赛礼包_03_大小球',
  //不可修改 
  packname: '小组赛礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '领取', '已结束', '已领取'],
  //可修改 购买价格
  price: '666',
  //可修改 划去的价格
  oldprice: '1044',
  //不可修改 玩法类型
  gameType: 'z_dx',
  //不可修改 包类型id
  packType: '1',
  //可修改 多少场比赛
  explain: '36场比赛<em>666</em>元特惠'
}];

// 淘汰赛礼包 out
__euro.yp_03 = yp_out = [{
  //不可修改 id 
  id: 'yp_03_01',
  //不可修改 
  name: '淘汰赛礼包_01_亚盘',
  //不可修改 
  packname: '淘汰赛礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '领取', '已结束', '已领取'],
  //可修改 购买价格
  price: '298',
  //可修改 划去的价格
  oldprice: '435',
  //不可修改 玩法类型
  gameType: 'z_sx',
  //不可修改 包类型id
  packType: '3',
  //可修改 多少场比赛
  explain: '15场比赛<em>298</em>元特惠'
}, {
  //不可修改 id 
  id: 'yp_03_02',
  //不可修改 
  name: '淘汰赛礼包_02_胜平负',
  //不可修改 
  packname: '淘汰赛礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '领取', '已结束', '已领取'],
  //可修改 购买价格
  price: '298',
  //可修改 划去的价格
  oldprice: '435',
  //不可修改 玩法类型
  gameType: 'z_spf',
  //不可修改 包类型id
  packType: '3',
  //可修改 多少场比赛
  explain: '15场比赛<em>298</em>元特惠'
}, {
  //不可修改 id 
  id: 'yp_03_03',
  //不可修改 
  name: '小组赛礼包_03_大小球',
  //不可修改 
  packname: '淘汰赛礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '领取', '已结束', '已领取'],
  //可修改 购买价格
  price: '298',
  //可修改 划去的价格
  oldprice: '435',
  //不可修改 玩法类型
  gameType: 'z_dx',
  //不可修改 包类型id
  packType: '3',
  //可修改 多少场比赛
  explain: '15场比赛<em>298</em>元特惠'
}];

// 真爱礼包 team
__euro.yp_04 = yp_team = [{
  //不可修改 id 
  id: '933',
  //不可修改 
  name: '真爱礼包_01_法国',
  //不可修改 
  packname: '法国真爱礼包',
  //可修改    1为马上预订 2为不可预订   3为已预订(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '马上预订', '不可预订', '已预订'],
  //可修改 购买价格
  price: '87',
  //可修改 划去的价格
  oldprice: '',
  //不可修改 玩法类型
  gameType: '',
  //不可修改 包类型id
  packType: '2',
  //可修改 多少场比赛
  explain: '',
  // 不可修改 是否购买对应玩法的真爱包 1,2未购买 3已购买
  z_sx: '1',
  z_spf: '1',
  z_dx: '1'
},{
  //不可修改 id 
  id: '934',
  //不可修改 
  name: '真爱礼包_02_德国',
  //不可修改 
  packname: '德国真爱礼包',
  //可修改    1为马上预订 2为不可预订   3为已预订(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '马上预订', '不可预订', '已预订'],
  //可修改 购买价格
  price: '87',
  //可修改 划去的价格
  oldprice: '',
  //不可修改 玩法类型
  gameType: '',
  //不可修改 包类型id
  packType: '2',
  //可修改 多少场比赛
  explain: '',
  // 不可修改 是否购买对应玩法的真爱包 1,2未购买 3已购买
  z_sx: '1',
  z_spf: '1',
  z_dx: '1'
}, {
  //不可修改 id 
  id: '944',
  //不可修改 
  name: '真爱礼包_03_西班牙',
  //不可修改 
  packname: '西班牙真爱礼包',
  //可修改    1为马上预订 2为不可预订   3为已预订(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '马上预订', '不可预订', '已预订'],
  //可修改 购买价格
  price: '87',
  //可修改 划去的价格
  oldprice: '',
  //不可修改 玩法类型
  gameType: '',
  //不可修改 包类型id
  packType: '2',
  //可修改 多少场比赛
  explain: '',
  // 不可修改 是否购买对应玩法的真爱包 1,2未购买 3已购买
  z_sx: '1',
  z_spf: '1',
  z_dx: '1'
}, {
  //不可修改 id 
  id: '922',
  //不可修改 
  name: '真爱礼包_04_英格兰',
  //不可修改 
  packname: '英格兰真爱礼包',
  //可修改    1为马上预订 2为不可预订   3为已预订(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '马上预订', '不可预订', '已预订'],
  //可修改 购买价格
  price: '87',
  //可修改 划去的价格
  oldprice: '',
  //不可修改 玩法类型
  gameType: '',
  //不可修改 包类型id
  packType: '2',
  //可修改 多少场比赛
  explain: '',
  // 不可修改 是否购买对应玩法的真爱包 1,2未购买 3已购买
  z_sx: '1',
  z_spf: '1',
  z_dx: '1'
}, {
  //不可修改 id 
  id: '924',
  //不可修改 
  name: '真爱礼包_05_比利时',
  //不可修改 
  packname: '比利时真爱礼包',
  //可修改    1为马上预订 2为不可预订   3为已预订(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '马上预订', '不可预订', '已预订'],
  //可修改 购买价格
  price: '87',
  //可修改 划去的价格
  oldprice: '',
  //不可修改 玩法类型
  gameType: '',
  //不可修改 包类型id
  packType: '2',
  //可修改 多少场比赛
  explain: '',
  // 不可修改 是否购买对应玩法的真爱包 1,2未购买 3已购买
  z_sx: '1',
  z_spf: '1',
  z_dx: '1'
}, {
  //不可修改 id 
  id: '821',
  //不可修改 
  name: '真爱礼包_06_瑞典',
  //不可修改 
  packname: '瑞典真爱礼包',
  //可修改    1为马上预订 2为不可预订   3为已预订(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '马上预订', '不可预订', '已预订'],
  //可修改 购买价格
  price: '87',
  //可修改 划去的价格
  oldprice: '',
  //不可修改 玩法类型
  gameType: '',
  //不可修改 包类型id
  packType: '2',
  //可修改 多少场比赛
  explain: '',
  // 不可修改 是否购买对应玩法的真爱包 1,2未购买 3已购买
  z_sx: '1',
  z_spf: '1',
  z_dx: '1'
}, {
  //不可修改 id 
  id: '939',
  //不可修改 
  name: '真爱礼包_07_葡萄牙',
  //不可修改 
  packname: '葡萄牙真爱礼包',
  //可修改    1为马上预订 2为不可预订   3为已预订(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '马上预订', '不可预订', '已预订'],
  //可修改 购买价格
  price: '87',
  //可修改 划去的价格
  oldprice: '',
  //不可修改 玩法类型
  gameType: '',
  //不可修改 包类型id
  packType: '2',
  //可修改 多少场比赛
  explain: '',
  // 不可修改 是否购买对应玩法的真爱包 1,2未购买 3已购买
  z_sx: '1',
  z_spf: '1',
  z_dx: '1'
}, {
  //不可修改 id 
  id: '926',
  //不可修改 
  name: '真爱礼包_08_意大利',
  //不可修改 
  packname: '意大利真爱礼包',
  //可修改    1为马上预订 2为不可预订   3为已预订(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '马上预订', '不可预订', '已预订'],
  //可修改 购买价格
  price: '87',
  //可修改 划去的价格
  oldprice: '',
  //不可修改 玩法类型
  gameType: '',
  //不可修改 包类型id
  packType: '2',
  //可修改 多少场比赛
  explain: '',
  // 不可修改 是否购买对应玩法的真爱包 1,2未购买 3已购买
  z_sx: '1',
  z_spf: '1',
  z_dx: '1'
}];



// 开幕礼包
window.__curdate = '2016-06-11';
__euro.yp_05 = yp_start = [{
  //不可修改 id 
  id: 'yp_05_01',
  //不可修改 
  name: '开幕礼包_01',
  //不可修改 
  packname: '开幕礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1'
}, {
  //不可修改 id 
  id: 'yp_05_02',
  //不可修改 
  name: '开幕礼包_02',
  //不可修改 
  packname: '开幕礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1'
}, {
  //不可修改 id 
  id: 'yp_05_03',
  //不可修改 
  name: '开幕礼包_03',
  //不可修改 
  packname: '开幕礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1'
}, {
  //不可修改 id 
  id: 'yp_05_04',
  //不可修改 
  name: '开幕礼包_04',
  //不可修改 
  packname: '开幕礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1'
}];