
// 手动控制区域
var __euro ={};
// 是否显示 1为显示 2为不显示
// 全赛事礼包 all
__euro.allIsShow = '1';
// 小组赛礼包 group
__euro.groupIsShow = '1';


// 淘汰赛礼包 out
__euro.yp_00 = yp_out = [{
  //不可修改 id 
  id: 'yp_00_01',
  //不可修改 
  name: '淘汰赛礼包_01_亚盘',
  //不可修改 
  packname: '淘汰赛礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '领取', '已结束', '已领取'],
  //可修改 购买价格
  price: '298',
  //可修改 划去的价格
  oldprice: '435',
  //不可修改 玩法类型
  gameType: 'z_sx',
  //不可修改 包类型id
  packType: '3',
  //可修改 多少场比赛
  explain: '15场比赛<em>298</em>元特惠'
}, {
  //不可修改 id 
  id: 'yp_00_02',
  //不可修改 
  name: '淘汰赛礼包_02_胜平负',
  //不可修改 
  packname: '淘汰赛礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '领取', '已结束', '已领取'],
  //可修改 购买价格
  price: '298',
  //可修改 划去的价格
  oldprice: '435',
  //不可修改 玩法类型
  gameType: 'z_spf',
  //不可修改 包类型id
  packType: '3',
  //可修改 多少场比赛
  explain: '15场比赛<em>298</em>元特惠'
}, {
  //不可修改 id 
  id: 'yp_00_03',
  //不可修改 
  name: '小组赛礼包_03_大小球',
  //不可修改 
  packname: '淘汰赛礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '领取', '已结束', '已领取'],
  //可修改 购买价格
  price: '298',
  //可修改 划去的价格
  oldprice: '435',
  //不可修改 玩法类型
  gameType: 'z_dx',
  //不可修改 包类型id
  packType: '3',
  //可修改 多少场比赛
  explain: '15场比赛<em>298</em>元特惠'
}, {
  //不可修改 id 
  id: 'yp_00_04',
  //不可修改 
  name: '小组赛礼包_03_全部',
  //不可修改 
  packname: '淘汰赛礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '领取', '已结束', '已领取'],
  //可修改 购买价格
  price: '788',
  //可修改 划去的价格
  oldprice: '1305',
  //不可修改 玩法类型
  gameType: 'z_all',
  //不可修改 包类型id
  packType: '6',
  //可修改 多少场比赛
  explain: '15场比赛<em>788</em>元特惠'
}];


// 全赛事礼包 all
__euro.yp_01 = yp_all = [{
  //不可修改 id 
  id: 'yp_01_01',
  //不可修改 
  name: '全赛事礼包_01_亚盘',
  //不可修改 
  packname: '全赛事礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '领取', '已结束', '已领取'],
  //可修改 购买价格
  price: '400',
  //可修改 划去的价格
  oldprice: '667',
  //不可修改 玩法类型
  gameType: 'z_sx',
  //不可修改 包类型id
  packType: '4',
  //可修改 多少场比赛
  explain: '23场比赛<em>400</em>元特惠'
}, {
  //不可修改 id 
  id: 'yp_01_02',
  //不可修改 
  name: '全赛事礼包_02_胜平负',
  //不可修改 
  packname: '全赛事礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '领取', '已结束', '已领取'],
  //可修改 购买价格
  price: '400',
  //可修改 划去的价格
  oldprice: '667',
  //不可修改 玩法类型
  gameType: 'z_spf',
  //不可修改 包类型id
  packType: '4',
  //可修改 多少场比赛
  explain: '23场比赛<em>667</em>元特惠'
}, {
  //不可修改 id 
  id: 'yp_01_03',
  //不可修改 
  name: '全赛事礼包_03_大小球',
  //不可修改 
  packname: '全赛事礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '领取', '已结束', '已领取'],
  //可修改 购买价格
  price: '400',
  //可修改 划去的价格
  oldprice: '667',
  //不可修改 玩法类型
  gameType: 'z_dx',
  //不可修改 包类型id
  packType: '4',
  //可修改 多少场比赛
  explain: '23场比赛<em>667</em>元特惠'
}];

// 小组赛礼包 group
__euro.yp_02 = yp_group = [{
  // 是否显示 1为显示 2为不显示  只取配置的第一个对象
  isShow: '1',
  //不可修改 id 
  id: 'yp_02_01',
  //不可修改 
  name: '小组赛礼包_01_亚盘',
  //不可修改 
  packname: '小组赛礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '领取', '已结束', '已领取'],
  //可修改 购买价格
  price: '148',
  //可修改 划去的价格
  oldprice: '232',
  //不可修改 玩法类型
  gameType: 'z_sx',
  //不可修改 包类型id
  packType: '1',
  //可修改 多少场比赛
  explain: '8场比赛<em>148</em>元特惠'
}, {
  //不可修改 id 
  id: 'yp_02_02',
  //不可修改 
  name: '小组赛礼包_02_胜平负',
  //不可修改 
  packname: '小组赛礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '领取', '已结束', '已领取'],
  //可修改 购买价格
  price: '148',
  //可修改 划去的价格
  oldprice: '232',
  //不可修改 玩法类型
  gameType: 'z_spf',
  //不可修改 包类型id
  packType: '1',
  //可修改 多少场比赛
  explain: '8场比赛<em>148</em>元特惠'
}, {
  //不可修改 id 
  id: 'yp_02_03',
  //不可修改 
  name: '小组赛礼包_03_大小球',
  //不可修改 
  packname: '小组赛礼包',
  //可修改    1为领取 2为已结束   3已领取(3这个状态由账号来判断,不可填)  
  status: '1',
  //不可修改 展示信息 
  msg: ['', '领取', '已结束', '已领取'],
  //可修改 购买价格
  price: '148',
  //可修改 划去的价格
  oldprice: '232',
  //不可修改 玩法类型
  gameType: 'z_dx',
  //不可修改 包类型id
  packType: '1',
  //可修改 多少场比赛
  explain: '8场比赛<em>148</em>元特惠'
}];

// 全赛事和小组赛下架时间
window.outdate = '2016-06-23 03:00';
